{
  "title": "As technology continues to advance, people are becoming increasingly connected to their devices and online world. With the rise of remote work and the need to stay connected during this time, it's more important than ever to take breaks from technology and focus on personal well-being. In 2025, digital detoxing will be redefined for urban professionals as a way to balance the demands of work and life in a more holistic sense. It will involve taking intentional steps to disconnect from screens and embrace activities that promote mental health and wellness such as meditation, exercise, and spending time with loved ones. The concept of \"digital detoxing\" will become less about avoiding technology altogether and more about using it mindfully and purposefully to enhance one's overall well-being.",
  "excerpt": "In 2025, four friends - Alice, Bob, Clara and Dave decided to take up the new digital detox challenge. They each adopted a different wellness practice (Meditation, Yoga, Journaling, and Exercise) as their way of disconnecting from technology.",
  "category": "lifestyle",
  "date": "2025-06-02",
  "readTime": "8 min read",
  "image": "☀️",
  "content": "<p>In 2025, four friends - Alice, Bob, Clara and Dave decided to take up the new digital detox challenge. They each adopted a different wellness practice (Meditation, Yoga, Journaling, and Exercise) as their way of disconnecting from technology.</p>\n<p>Here are some clues:</p>\n<ol>\n<li>\n<p>The one who chose meditation isn't Alice or Bob.</p>\n</li>\n<li>\n<p>Clara didn’t choose yoga.</p>\n</li>\n<li>\n<p>Dave didn't take up journaling.</p>\n</li>\n<li>\n<p>The person who chose exercise is either Alice or the one sitting to his right.</p>\n</li>\n<li>\n<p>Claire, sitting on Alice's immediate left doesn't practice Yoga or Meditation.</p>\n</li>\n<li>\n<p>The person who practices meditation sits next to the person practicing Yoga.</p>\n</li>\n</ol>\n<p>Question: Who practices which wellness method?</p>\n<p>First we can use the process of elimination and inductive logic to start narrowing down each friend's possible choices based on the given clues. From clue 3, Dave didn't take up journaling, from clues 1 and 5, the one who chose meditation is not Alice or Bob and neither are Claire (since she sits next to the person practicing Yoga). This means that Clara practices Meditation.</p>\n<p>Since Clara is taking up Meditation, then by deductive logic and using clue 6, the person sitting on her right must be doing Yoga.</p>\n<p>If we assume Dave is to the right of Alice, according to clue 4, this can’t be true as he doesn't practice Exercise. Therefore, Alice has to be the one who practices Exercise (since she's only left with this option). This leaves Bob and Dave, but since clue 1 says that Bob cannot do Meditation, Bob must be doing Yoga and hence, Dave is left with Journaling.</p>\n<p>Answer: Alice does Exercise, Bob does Yoga, Clara does Meditation, and Dave does Journaling.</p>"
}