{
  "title": "I do not have access to recent trends, but based on research and indus",
  "excerpt": "Consider three designers: Alice, Bob, and Charlie. Each is designing a different project: an...",
  "category": "design",
  "date": "2025-06-03",
  "readTime": "11 min read",
  "image": "🎨",
  "content": "<p>Consider three designers: Alice, Bob, and Charlie. Each is designing a different project: an interior, web design, or both in a hybrid way (a combination of the two). They're each choosing a different color palette to use: monochromatic, neutral, or vibrant colors. They also have preferences for furniture styles: clean lines, intricate details, or rustic charm.</p>\n<p>Here are some clues about their choices:</p>\n<ol>\n<li>\n<p>Alice is not designing an interior project and she's not using vibrant colors.</p>\n</li>\n<li>\n<p>The designer who uses a monochromatic color scheme isn't designing the web project.</p>\n</li>\n<li>\n<p>Bob is designing in a hybrid way, but he doesn't use neutral colors for his project.</p>\n</li>\n<li>\n<p>Charlie does not prefer clean lines or rustic charm and he's not working on an interior project.</p>\n</li>\n<li>\n<p>The designer of the web design uses vibrant colors.</p>\n</li>\n</ol>\n<p>Question: What are each of Alice, Bob, and Charlie designing (interior, web, or hybrid), what color palette they're using (monochromatic, neutral, or vibrant), and their preferred furniture style (clean lines, intricate details, or rustic charm)?</p>\n<p>From Clue 1 we know that Alice is neither designing the interior nor is she using vibrant colors. From Clue 3, Bob is designing in a hybrid way but not using neutral colors. Hence, Alice must be using vibrant colors and Bob is working on an interior project since he can't be designing a web project (Clue 2).</p>\n<p>From Step 1, Charlie must be the one who designs the web project as Alice isn't and it's stated that only one person can design each type of project. So, Charlie uses neutral colors by default since vibrant ones are taken by Alice.</p>\n<p>Bob cannot use neutral colors or rustic charm (Clue 4), so he uses clean lines for his interior design. Now, since Bob is using clean lines, and the designer of web design also has to use clean lines according to Clue 5, Charlie must be the one designing a hybrid project using clean lines.</p>\n<p>The only color left for Charlie's project is monochromatic (it's not neutral or vibrant) because those are taken by Alice and Bob respectively. The furniture style for Charlie's project can't be rustic charm as per Clue 4, so it must be intricate details.</p>\n<p>As rustic charm isn’t preferred by Charlie from Clue 4, it must be the choice of Alice since her other two choices have been ruled out. Thus, her furniture style is therefore rustic charm.</p>\n<p>Answer: Alice is designing a web project using vibrant colors and prefers rustic charm for her design. Bob is creating an interior with clean lines and neutral colors. Charlie, who's working on a hybrid project, uses monochromatic colors and intricate details for his design.</p>"
}